// описываем категории и сразу экспортируем
export const CATEGORIES = [
    {
      title: "📘 Паттерны проектирования",
      type:  "паттерны",
      columns: ["Название", "Тип", "Применяется"]
    },
    {
      title: "📙 Архитектурные паттерны",
      type:  "архитектуры",
      columns: ["Название", "Для чего", "Особенности"]
    },
    {
      title: "🧰 Инструменты и технологии",
      type:  "средства",
      columns: ["Название", "Категория", "Назначение"]
    }
    
  ];
  console.log("categories.js загружен", CATEGORIES);
  