// описываем категории и сразу экспортируем
export const CATEGORIES = [
    {
      title: "📘 Паттерны проектирования",
      type:  "паттерны",
      columns: ["Название", "Тип", "Применяется"]
    },
    {
      title: "📙 Архитектурные паттерны",
      type:  "архитектуры",
      columns: ["Название", "Для чего", "Особенности"]
    },
    {
      title: "🧰 Инструменты и технологии",
      type:  "средства",
      columns: ["Название", "Категория", "Назначение"]
    },
    {
      title: "🔬 Алгоритмы",
      type:  "алгоритмы",
      columns: ["Название", "Категория", "Применение"]
    },
    {
      title: "⚙️ Стандарты C++",
      type:  "стандарты C++",
      columns: ["Название", "Категория", "Описание"]
    },
    {
      type:  "stl",
      columns: ["Название", "Категория", "Описание"]
    },
    {
      title: "🔍 Микроконтроллеры ",
      type:  "микроконтроллеры",
      columns: ["Название", "Категория", "Описание"]
    }
    
  ];
  console.log("categories.js загружен", CATEGORIES);